//
//  BaseTableViewController.swift
//  SLWeiBo
//
//  Created by Anthony on 17/3/7.
//  Copyright © 2017年 SLZeng. All rights reserved.
//

import UIKit

class BaseTableViewController: UITableViewController {

    //==========================================================================================================
    // MARK: - 懒加载属性
    //==========================================================================================================
    /// 访客视图
    lazy var visitorView : VisitorView = VisitorView.visitorView()
    
    //==========================================================================================================
    // MARK: - 自定义变量
    //==========================================================================================================
    /// 定义标记记录用户登录状态
    var isLogin : Bool = false
    
    //==========================================================================================================
    // MARK: - 系统回调函数
    //==========================================================================================================
    
    override func loadView() {
        // 判断用户是否登录, 如果没有登录就显示访客界面, 如果已经登录就显示tableview
        isLogin ? super.loadView() : setupVisitorView()
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
    }
}

//==========================================================================================================
// MARK: - 自定义函数
//==========================================================================================================
extension BaseTableViewController {
    
    /**
     设置访客视图
     */
    private func setupVisitorView() {
        view = visitorView
    }
}
